app/Controllers/AdminController.php

    public function index() {
        $model = new BookModel();
        $data['books'] = $model->findAll();
---
SELECT *
FROM `books`