app/Controllers/AuthController.php

    public function loginProcess()
    {
        helper(['form']);
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if(!$this->validate($rules)) {
            return redirect()->to('/login')->with('errors', $this->validator->getErrors());
        }

        $model = new UserModel();
        $user = $model->where('username', $this->request->getVar('username'))->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1