app/Controllers/UserController.php

    public function index() {
        $model = new BookModel();
        $keyword = $this->request->getGet('q');

        if ($keyword) {
            $data['books'] = $model->like('title', $keyword)->findAll();
---
SELECT *
FROM `books`
WHERE `title` LIKE '%m%' ESCAPE '!'

    public function borrowHistory() {
        $user_id = session()->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login')->with('error', 'Harap login terlebih dahulu');
        }

        $borrowModel = new BorrowHistoryModel();
        $bookModel = new BookModel();

        $data['history'] = $borrowModel
            ->select('borrow_history.*, books.title')
            ->join('books', 'books.id = borrow_history.book_id')
            ->where('borrow_history.user_id', $user_id)
            ->orderBy('borrow_date', 'DESC')
            ->findAll();
---
SELECT `borrow_history`.*, `books`.`title`
FROM `borrow_history`
JOIN `books` ON `books`.`id` = `borrow_history`.`book_id`
WHERE `borrow_history`.`user_id` = '11'
ORDER BY `borrow_date` DESC

    public function borrowedBooks() {
    $user_id = session()->get('user_id');
    if (!$user_id) {
        return redirect()->to('/login')->with('error', 'Harap login terlebih dahulu');
    }

    $borrowModel = new BorrowHistoryModel();

    $data['books'] = $borrowModel
        ->select('books.*, borrow_history.id as borrow_id, borrow_history.borrow_date')
        ->join('books', 'books.id = borrow_history.book_id')
        ->where('borrow_history.user_id', $user_id)
        ->where('borrow_history.return_date', null)
        ->findAll();
---
SELECT `books`.*, `borrow_history`.`id` as `borrow_id`, `borrow_history`.`borrow_date`
FROM `borrow_history`
JOIN `books` ON `books`.`id` = `borrow_history`.`book_id`
WHERE `borrow_history`.`user_id` = '11'
AND `borrow_history`.`return_date` IS NULL