app/Controllers/UserController.php

    public function index() {
        $model = new BookModel();
        $data['books'] = $model->findAll();
---
SELECT *
FROM `books`

    public function detail($id) {
        $model = new BookModel();
        $data['book'] = $model->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '2'

    public function borrow($book_id) {
        $bookModel = new BookModel();
        $borrowModel = new BorrowHistoryModel();

        $book = $bookModel->find($book_id);
        if (!$book) {
            return redirect()->to('/user')->with('error', 'Buku tidak ditemukan');
        }
        if ($book['status'] == 'borrowed') {
            return redirect()->to('/user')->with('error', 'Buku sedang dipinjam');
        }

        $user_id = session()->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login')->with('error', 'Harap login terlebih dahulu');
        }

        $bookModel->update($book_id, ['status' => 'borrowed']);

        $borrowModel->save([
            'user_id' => $user_id,
            'book_id' => $book_id,
            'borrow_date' => date('Y-m-d H:i:s'),
            'return_date' => null,
        ]);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '3'
UPDATE `books` SET `status` = 'borrowed'
WHERE `books`.`id` IN ('3')
INSERT INTO `borrow_history` (`user_id`, `book_id`, `borrow_date`, `return_date`) VALUES ('5', '3', '2025-05-28 02:35:04', NULL)

    public function borrowHistory() {
        $user_id = session()->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login')->with('error', 'Harap login terlebih dahulu');
        }

        $borrowModel = new BorrowHistoryModel();
        $bookModel = new BookModel();

        $data['history'] = $borrowModel
            ->select('borrow_history.*, books.title')
            ->join('books', 'books.id = borrow_history.book_id')
            ->where('borrow_history.user_id', $user_id)
            ->orderBy('borrow_date', 'DESC')
            ->findAll();
---
SELECT `borrow_history`.*, `books`.`title`
FROM `borrow_history`
JOIN `books` ON `books`.`id` = `borrow_history`.`book_id`
WHERE `borrow_history`.`user_id` = '5'
ORDER BY `borrow_date` DESC

    public function returnBook($borrow_id)
    {
        $user_id = session()->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login')->with('error', 'Harap login terlebih dahulu');
        }

        $borrowModel = new \App\Models\BorrowHistoryModel();
        $bookModel = new \App\Models\BookModel();

        $borrow = $borrowModel->find($borrow_id);

        if (!$borrow || $borrow['user_id'] != $user_id || $borrow['return_date'] !== null) {
            return redirect()->to('/user/history')->with('error', 'Data tidak valid');
        }

        // Update return_date
        $borrowModel->update($borrow_id, [
            'return_date' => date('Y-m-d H:i:s')
        ]);

        // Update status buku jadi tersedia kembali
        $bookModel->update($borrow['book_id'], [
            'status' => 'available'
        ]);
---
SELECT *
FROM `borrow_history`
WHERE `borrow_history`.`id` = '5'
UPDATE `borrow_history` SET `return_date` = '2025-05-28 02:34:44'
WHERE `borrow_history`.`id` IN ('5')
UPDATE `books` SET `status` = 'available'
WHERE `books`.`id` IN ('2')